tap "homebrew/bundle"

brew "git"
brew "gh"

brew "zsh"
brew "starship"
brew "zoxide"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "eza"
brew "jq"
brew "tree"
brew "wget"
brew "curl"
brew "direnv"
brew "mise"      # toolchain manager (node/ruby/etc)

brew "openssl@3"
brew "readline"
brew "libyaml"

cask "font-hack-nerd-font"

cask "ghostty"
cask "zed"
